7767517
398 453
Input                    in0                      0 1 in0
Convolution              conv_9                   1 1 in0 1 0=80 1=6 11=6 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=8640
Swish                    silu_141                 1 1 1 2
Convolution              conv_10                  1 1 2 3 0=160 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=115200
Swish                    silu_142                 1 1 3 4
Split                    splitncnn_0              1 2 4 5 6
Convolution              conv_11                  1 1 6 7 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12800
Swish                    silu_143                 1 1 7 8
Split                    splitncnn_1              1 2 8 9 10
Convolution              conv_12                  1 1 10 11 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400
Swish                    silu_144                 1 1 11 12
Convolution              conv_13                  1 1 12 13 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=57600
Swish                    silu_145                 1 1 13 14
BinaryOp                 add_0                    2 1 9 14 15 0=0
Split                    splitncnn_2              1 2 15 16 17
Convolution              conv_14                  1 1 17 18 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400
Swish                    silu_146                 1 1 18 19
Convolution              conv_15                  1 1 19 20 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=57600
Swish                    silu_147                 1 1 20 21
BinaryOp                 add_1                    2 1 16 21 22 0=0
Split                    splitncnn_3              1 2 22 23 24
Convolution              conv_16                  1 1 24 25 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400
Swish                    silu_148                 1 1 25 26
Convolution              conv_17                  1 1 26 27 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=57600
Swish                    silu_149                 1 1 27 28
BinaryOp                 add_2                    2 1 23 28 29 0=0
Split                    splitncnn_4              1 2 29 30 31
Convolution              conv_18                  1 1 31 32 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400
Swish                    silu_150                 1 1 32 33
Convolution              conv_19                  1 1 33 34 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=57600
Swish                    silu_151                 1 1 34 35
BinaryOp                 add_3                    2 1 30 35 36 0=0
Convolution              conv_20                  1 1 5 37 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12800
Swish                    silu_152                 1 1 37 38
Concat                   cat_0                    2 1 36 38 39 0=0
Convolution              conv_21                  1 1 39 40 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25600
Swish                    silu_153                 1 1 40 41
Convolution              conv_22                  1 1 41 42 0=320 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=460800
Swish                    silu_154                 1 1 42 43
Split                    splitncnn_5              1 2 43 44 45
Convolution              conv_23                  1 1 45 46 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=51200
Swish                    silu_155                 1 1 46 47
Split                    splitncnn_6              1 2 47 48 49
Convolution              conv_24                  1 1 49 50 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25600
Swish                    silu_156                 1 1 50 51
Convolution              conv_25                  1 1 51 52 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=230400
Swish                    silu_157                 1 1 52 53
BinaryOp                 add_4                    2 1 48 53 54 0=0
Split                    splitncnn_7              1 2 54 55 56
Convolution              conv_26                  1 1 56 57 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25600
Swish                    silu_158                 1 1 57 58
Convolution              conv_27                  1 1 58 59 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=230400
Swish                    silu_159                 1 1 59 60
BinaryOp                 add_5                    2 1 55 60 61 0=0
Split                    splitncnn_8              1 2 61 62 63
Convolution              conv_28                  1 1 63 64 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25600
Swish                    silu_160                 1 1 64 65
Convolution              conv_29                  1 1 65 66 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=230400
Swish                    silu_161                 1 1 66 67
BinaryOp                 add_6                    2 1 62 67 68 0=0
Split                    splitncnn_9              1 2 68 69 70
Convolution              conv_30                  1 1 70 71 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25600
Swish                    silu_162                 1 1 71 72
Convolution              conv_31                  1 1 72 73 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=230400
Swish                    silu_163                 1 1 73 74
BinaryOp                 add_7                    2 1 69 74 75 0=0
Split                    splitncnn_10             1 2 75 76 77
Convolution              conv_32                  1 1 77 78 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25600
Swish                    silu_164                 1 1 78 79
Convolution              conv_33                  1 1 79 80 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=230400
Swish                    silu_165                 1 1 80 81
BinaryOp                 add_8                    2 1 76 81 82 0=0
Split                    splitncnn_11             1 2 82 83 84
Convolution              conv_34                  1 1 84 85 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25600
Swish                    silu_166                 1 1 85 86
Convolution              conv_35                  1 1 86 87 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=230400
Swish                    silu_167                 1 1 87 88
BinaryOp                 add_9                    2 1 83 88 89 0=0
Split                    splitncnn_12             1 2 89 90 91
Convolution              conv_36                  1 1 91 92 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25600
Swish                    silu_168                 1 1 92 93
Convolution              conv_37                  1 1 93 94 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=230400
Swish                    silu_169                 1 1 94 95
BinaryOp                 add_10                   2 1 90 95 96 0=0
Split                    splitncnn_13             1 2 96 97 98
Convolution              conv_38                  1 1 98 99 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25600
Swish                    silu_170                 1 1 99 100
Convolution              conv_39                  1 1 100 101 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=230400
Swish                    silu_171                 1 1 101 102
BinaryOp                 add_11                   2 1 97 102 103 0=0
Convolution              conv_40                  1 1 44 104 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=51200
Swish                    silu_172                 1 1 104 105
Concat                   cat_1                    2 1 103 105 106 0=0
Convolution              conv_41                  1 1 106 107 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_173                 1 1 107 108
Split                    splitncnn_14             1 2 108 109 110
Convolution              conv_42                  1 1 110 111 0=640 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1843200
Swish                    silu_174                 1 1 111 112
Split                    splitncnn_15             1 2 112 113 114
Convolution              conv_43                  1 1 114 115 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=204800
Swish                    silu_175                 1 1 115 116
Split                    splitncnn_16             1 2 116 117 118
Convolution              conv_44                  1 1 118 119 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_176                 1 1 119 120
Convolution              conv_45                  1 1 120 121 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_177                 1 1 121 122
BinaryOp                 add_12                   2 1 117 122 123 0=0
Split                    splitncnn_17             1 2 123 124 125
Convolution              conv_46                  1 1 125 126 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_178                 1 1 126 127
Convolution              conv_47                  1 1 127 128 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_179                 1 1 128 129
BinaryOp                 add_13                   2 1 124 129 130 0=0
Split                    splitncnn_18             1 2 130 131 132
Convolution              conv_48                  1 1 132 133 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_180                 1 1 133 134
Convolution              conv_49                  1 1 134 135 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_181                 1 1 135 136
BinaryOp                 add_14                   2 1 131 136 137 0=0
Split                    splitncnn_19             1 2 137 138 139
Convolution              conv_50                  1 1 139 140 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_182                 1 1 140 141
Convolution              conv_51                  1 1 141 142 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_183                 1 1 142 143
BinaryOp                 add_15                   2 1 138 143 144 0=0
Split                    splitncnn_20             1 2 144 145 146
Convolution              conv_52                  1 1 146 147 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_184                 1 1 147 148
Convolution              conv_53                  1 1 148 149 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_185                 1 1 149 150
BinaryOp                 add_16                   2 1 145 150 151 0=0
Split                    splitncnn_21             1 2 151 152 153
Convolution              conv_54                  1 1 153 154 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_186                 1 1 154 155
Convolution              conv_55                  1 1 155 156 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_187                 1 1 156 157
BinaryOp                 add_17                   2 1 152 157 158 0=0
Split                    splitncnn_22             1 2 158 159 160
Convolution              conv_56                  1 1 160 161 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_188                 1 1 161 162
Convolution              conv_57                  1 1 162 163 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_189                 1 1 163 164
BinaryOp                 add_18                   2 1 159 164 165 0=0
Split                    splitncnn_23             1 2 165 166 167
Convolution              conv_58                  1 1 167 168 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_190                 1 1 168 169
Convolution              conv_59                  1 1 169 170 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_191                 1 1 170 171
BinaryOp                 add_19                   2 1 166 171 172 0=0
Split                    splitncnn_24             1 2 172 173 174
Convolution              conv_60                  1 1 174 175 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_192                 1 1 175 176
Convolution              conv_61                  1 1 176 177 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_193                 1 1 177 178
BinaryOp                 add_20                   2 1 173 178 179 0=0
Split                    splitncnn_25             1 2 179 180 181
Convolution              conv_62                  1 1 181 182 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_194                 1 1 182 183
Convolution              conv_63                  1 1 183 184 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_195                 1 1 184 185
BinaryOp                 add_21                   2 1 180 185 186 0=0
Split                    splitncnn_26             1 2 186 187 188
Convolution              conv_64                  1 1 188 189 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_196                 1 1 189 190
Convolution              conv_65                  1 1 190 191 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_197                 1 1 191 192
BinaryOp                 add_22                   2 1 187 192 193 0=0
Split                    splitncnn_27             1 2 193 194 195
Convolution              conv_66                  1 1 195 196 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_198                 1 1 196 197
Convolution              conv_67                  1 1 197 198 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_199                 1 1 198 199
BinaryOp                 add_23                   2 1 194 199 200 0=0
Convolution              conv_68                  1 1 113 201 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=204800
Swish                    silu_200                 1 1 201 202
Concat                   cat_2                    2 1 200 202 203 0=0
Convolution              conv_69                  1 1 203 204 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600
Swish                    silu_201                 1 1 204 205
Split                    splitncnn_28             1 2 205 206 207
Convolution              conv_70                  1 1 207 208 0=1280 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=7372800
Swish                    silu_202                 1 1 208 209
Split                    splitncnn_29             1 2 209 210 211
Convolution              conv_71                  1 1 211 212 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=819200
Swish                    silu_203                 1 1 212 213
Split                    splitncnn_30             1 2 213 214 215
Convolution              conv_72                  1 1 215 216 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600
Swish                    silu_204                 1 1 216 217
Convolution              conv_73                  1 1 217 218 0=640 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3686400
Swish                    silu_205                 1 1 218 219
BinaryOp                 add_24                   2 1 214 219 220 0=0
Split                    splitncnn_31             1 2 220 221 222
Convolution              conv_74                  1 1 222 223 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600
Swish                    silu_206                 1 1 223 224
Convolution              conv_75                  1 1 224 225 0=640 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3686400
Swish                    silu_207                 1 1 225 226
BinaryOp                 add_25                   2 1 221 226 227 0=0
Split                    splitncnn_32             1 2 227 228 229
Convolution              conv_76                  1 1 229 230 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600
Swish                    silu_208                 1 1 230 231
Convolution              conv_77                  1 1 231 232 0=640 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3686400
Swish                    silu_209                 1 1 232 233
BinaryOp                 add_26                   2 1 228 233 234 0=0
Split                    splitncnn_33             1 2 234 235 236
Convolution              conv_78                  1 1 236 237 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600
Swish                    silu_210                 1 1 237 238
Convolution              conv_79                  1 1 238 239 0=640 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3686400
Swish                    silu_211                 1 1 239 240
BinaryOp                 add_27                   2 1 235 240 241 0=0
Convolution              conv_80                  1 1 210 242 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=819200
Swish                    silu_212                 1 1 242 243
Concat                   cat_3                    2 1 241 243 244 0=0
Convolution              conv_81                  1 1 244 245 0=1280 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1638400
Swish                    silu_213                 1 1 245 246
Convolution              conv_82                  1 1 246 247 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=819200
Swish                    silu_214                 1 1 247 248
Split                    splitncnn_34             1 2 248 249 250
Pooling                  maxpool2d_138            1 1 250 251 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_35             1 2 251 252 253
Pooling                  maxpool2d_139            1 1 253 254 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_36             1 2 254 255 256
Pooling                  maxpool2d_140            1 1 256 257 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 249 252 255 257 258 0=0
Convolution              conv_83                  1 1 258 259 0=1280 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3276800
Swish                    silu_215                 1 1 259 260
Convolution              conv_84                  1 1 260 261 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=819200
Swish                    silu_216                 1 1 261 262
Split                    splitncnn_37             1 2 262 263 264
Interp                   upsample_267             1 1 264 265 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_5                    2 1 265 206 266 0=0
Split                    splitncnn_38             1 2 266 267 268
Convolution              conv_85                  1 1 268 269 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600
Swish                    silu_217                 1 1 269 270
Convolution              conv_86                  1 1 270 271 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_218                 1 1 271 272
Convolution              conv_87                  1 1 272 273 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_219                 1 1 273 274
Convolution              conv_88                  1 1 274 275 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_220                 1 1 275 276
Convolution              conv_89                  1 1 276 277 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_221                 1 1 277 278
Convolution              conv_90                  1 1 278 279 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_222                 1 1 279 280
Convolution              conv_91                  1 1 280 281 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_223                 1 1 281 282
Convolution              conv_92                  1 1 282 283 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_224                 1 1 283 284
Convolution              conv_93                  1 1 284 285 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Convolution              conv_94                  1 1 267 286 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600
Swish                    silu_226                 1 1 286 287
Swish                    silu_225                 1 1 285 288
Concat                   cat_6                    2 1 288 287 289 0=0
Convolution              conv_95                  1 1 289 290 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600
Swish                    silu_227                 1 1 290 291
Convolution              conv_96                  1 1 291 292 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=204800
Swish                    silu_228                 1 1 292 293
Split                    splitncnn_39             1 2 293 294 295
Interp                   upsample_268             1 1 295 296 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_7                    2 1 296 109 297 0=0
Split                    splitncnn_40             1 2 297 298 299
Convolution              conv_97                  1 1 299 300 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_229                 1 1 300 301
Convolution              conv_98                  1 1 301 302 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25600
Swish                    silu_230                 1 1 302 303
Convolution              conv_99                  1 1 303 304 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=230400
Swish                    silu_231                 1 1 304 305
Convolution              conv_100                 1 1 305 306 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25600
Swish                    silu_232                 1 1 306 307
Convolution              conv_101                 1 1 307 308 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=230400
Swish                    silu_233                 1 1 308 309
Convolution              conv_102                 1 1 309 310 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25600
Swish                    silu_234                 1 1 310 311
Convolution              conv_103                 1 1 311 312 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=230400
Swish                    silu_235                 1 1 312 313
Convolution              conv_104                 1 1 313 314 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=25600
Swish                    silu_236                 1 1 314 315
Convolution              conv_105                 1 1 315 316 0=160 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=230400
Convolution              conv_106                 1 1 298 317 0=160 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_238                 1 1 317 318
Swish                    silu_237                 1 1 316 319
Concat                   cat_8                    2 1 319 318 320 0=0
Convolution              conv_107                 1 1 320 321 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_239                 1 1 321 322
Split                    splitncnn_41             1 3 322 323 324 325
Convolution              conv_108                 1 1 325 326 0=320 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=921600
Swish                    silu_240                 1 1 326 327
Concat                   cat_9                    2 1 327 294 328 0=0
Split                    splitncnn_42             1 2 328 329 330
Convolution              conv_109                 1 1 330 331 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=204800
Swish                    silu_241                 1 1 331 332
Convolution              conv_110                 1 1 332 333 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_242                 1 1 333 334
Convolution              conv_111                 1 1 334 335 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_243                 1 1 335 336
Convolution              conv_112                 1 1 336 337 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_244                 1 1 337 338
Convolution              conv_113                 1 1 338 339 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_245                 1 1 339 340
Convolution              conv_114                 1 1 340 341 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_246                 1 1 341 342
Convolution              conv_115                 1 1 342 343 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_247                 1 1 343 344
Convolution              conv_116                 1 1 344 345 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=102400
Swish                    silu_248                 1 1 345 346
Convolution              conv_117                 1 1 346 347 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Convolution              conv_118                 1 1 329 348 0=320 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=204800
Swish                    silu_250                 1 1 348 349
Swish                    silu_249                 1 1 347 350
Concat                   cat_10                   2 1 350 349 351 0=0
Convolution              conv_119                 1 1 351 352 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600
Swish                    silu_251                 1 1 352 353
Split                    splitncnn_43             1 2 353 354 355
Convolution              conv_120                 1 1 355 356 0=640 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=3686400
Swish                    silu_252                 1 1 356 357
Concat                   cat_11                   2 1 357 263 358 0=0
Split                    splitncnn_44             1 2 358 359 360
Convolution              conv_121                 1 1 360 361 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=819200
Swish                    silu_253                 1 1 361 362
Convolution              conv_122                 1 1 362 363 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600
Swish                    silu_254                 1 1 363 364
Convolution              conv_123                 1 1 364 365 0=640 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3686400
Swish                    silu_255                 1 1 365 366
Convolution              conv_124                 1 1 366 367 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600
Swish                    silu_256                 1 1 367 368
Convolution              conv_125                 1 1 368 369 0=640 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3686400
Swish                    silu_257                 1 1 369 370
Convolution              conv_126                 1 1 370 371 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600
Swish                    silu_258                 1 1 371 372
Convolution              conv_127                 1 1 372 373 0=640 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3686400
Swish                    silu_259                 1 1 373 374
Convolution              conv_128                 1 1 374 375 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=409600
Swish                    silu_260                 1 1 375 376
Convolution              conv_129                 1 1 376 377 0=640 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3686400
Convolution              conv_130                 1 1 359 378 0=640 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=819200
Swish                    silu_262                 1 1 378 379
Swish                    silu_261                 1 1 377 380
Concat                   cat_12                   2 1 380 379 381 0=0
Convolution              conv_131                 1 1 381 382 0=1280 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1638400
MemoryData               pnnx_95                  0 1 383 0=2 1=20 11=20 2=3
MemoryData               pnnx_96                  0 1 384 0=2 1=20 11=20 2=3
MemoryData               pnnx_97                  0 1 385 0=2 1=40 11=40 2=3
MemoryData               pnnx_98                  0 1 386 0=2 1=40 11=40 2=3
MemoryData               pnnx_100                 0 1 387 0=2 1=80 11=80 2=3
MemoryData               pnnx_102                 0 1 388 0=2 1=80 11=80 2=3
Convolution              conv_132                 1 1 324 389 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_264                 1 1 389 390
Interp                   upsample_269             1 1 390 391 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Convolution              conv_133                 1 1 391 392 0=320 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=921600
Swish                    silu_265                 1 1 392 393
Convolution              conv_134                 1 1 393 394 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=10240
Convolution              conv_135                 1 1 323 out1 0=351 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=112320
Reshape                  view_273                 1 1 out1 396 0=80 1=80 11=117 2=3
Permute                  permute_279              1 1 396 397 0=3
Slice                    split_0                  1 4 397 398 399 400 401 -23300=4,2,2,81,32 1=3
MemoryData               pnnx_fold_1009           0 1 402 0=1
Sigmoid                  sigmoid_0                1 1 398 403
Eltwise                  weighted_sum_0           2 1 403 388 404 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 mul_30                   2 1 404 402 405 0=2
Sigmoid                  sigmoid_1                1 1 399 406
BinaryOp                 mul_31                   1 1 406 407 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_32                   1 1 407 408 0=4
BinaryOp                 mul_33                   2 1 408 387 409 0=2
Sigmoid                  sigmoid_2                1 1 400 410
Concat                   cat_13                   4 1 405 409 410 401 411 0=3
Convolution              conv_136                 1 1 354 out2 0=351 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=224640
Reshape                  view_274                 1 1 out2 413 0=40 1=40 11=117 2=3
Permute                  permute_280              1 1 413 414 0=3
Slice                    split_1                  1 4 414 415 416 417 418 -23300=4,2,2,81,32 1=3
MemoryData               pnnx_fold_1048           0 1 419 0=1
Sigmoid                  sigmoid_3                1 1 415 420
Eltwise                  weighted_sum_1           2 1 420 386 421 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 mul_36                   2 1 421 419 422 0=2
Sigmoid                  sigmoid_4                1 1 416 423
BinaryOp                 mul_37                   1 1 423 424 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_38                   1 1 424 425 0=4
BinaryOp                 mul_39                   2 1 425 385 426 0=2
Sigmoid                  sigmoid_5                1 1 417 427
Concat                   cat_14                   4 1 422 426 427 418 428 0=3
Swish                    silu_263                 1 1 382 429
Convolution              conv_137                 1 1 429 out3 0=351 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=449280
Reshape                  view_275                 1 1 out3 431 0=20 1=20 11=117 2=3
Permute                  permute_281              1 1 431 432 0=3
Slice                    split_2                  1 4 432 433 434 435 436 -23300=4,2,2,81,32 1=3
MemoryData               pnnx_fold_1087           0 1 437 0=1
Sigmoid                  sigmoid_6                1 1 433 438
Eltwise                  weighted_sum_2           2 1 438 384 439 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 mul_42                   2 1 439 437 440 0=2
Sigmoid                  sigmoid_7                1 1 434 441
BinaryOp                 mul_43                   1 1 441 442 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_44                   1 1 442 443 0=4
BinaryOp                 mul_45                   2 1 443 383 444 0=2
Sigmoid                  sigmoid_8                1 1 435 445
Concat                   cat_15                   4 1 440 444 445 436 446 0=3
Reshape                  view_278                 1 1 411 447 0=117 1=19200
Reshape                  view_277                 1 1 428 448 0=117 1=4800
Reshape                  view_276                 1 1 446 449 0=117 1=1200
Concat                   cat_16                   3 1 447 448 449 out0 0=0
Swish                    silu_266                 1 1 394 out-seg
Reshape                  custom_layer             1 1 out-seg seg 0=-1 1=32