7767517
268 305
Input                    in0                      0 1 in0
Convolution              conv_3                   1 1 in0 1 0=48 1=6 11=6 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=5184
Swish                    silu_88                  1 1 1 2
Convolution              conv_4                   1 1 2 3 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=41472
Swish                    silu_89                  1 1 3 4
Split                    splitncnn_0              1 2 4 5 6
Convolution              conv_5                   1 1 6 7 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Swish                    silu_90                  1 1 7 8
Split                    splitncnn_1              1 2 8 9 10
Convolution              conv_6                   1 1 10 11 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_91                  1 1 11 12
Convolution              conv_7                   1 1 12 13 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_92                  1 1 13 14
BinaryOp                 add_0                    2 1 9 14 15 0=0
Split                    splitncnn_2              1 2 15 16 17
Convolution              conv_8                   1 1 17 18 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_93                  1 1 18 19
Convolution              conv_9                   1 1 19 20 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_94                  1 1 20 21
BinaryOp                 add_1                    2 1 16 21 22 0=0
Convolution              conv_10                  1 1 5 23 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Swish                    silu_95                  1 1 23 24
Concat                   cat_0                    2 1 22 24 25 0=0
Convolution              conv_11                  1 1 25 26 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_96                  1 1 26 27
Convolution              conv_12                  1 1 27 28 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=165888
Swish                    silu_97                  1 1 28 29
Split                    splitncnn_3              1 2 29 30 31
Convolution              conv_13                  1 1 31 32 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_98                  1 1 32 33
Split                    splitncnn_4              1 2 33 34 35
Convolution              conv_14                  1 1 35 36 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_99                  1 1 36 37
Convolution              conv_15                  1 1 37 38 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_100                 1 1 38 39
BinaryOp                 add_2                    2 1 34 39 40 0=0
Split                    splitncnn_5              1 2 40 41 42
Convolution              conv_16                  1 1 42 43 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_101                 1 1 43 44
Convolution              conv_17                  1 1 44 45 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_102                 1 1 45 46
BinaryOp                 add_3                    2 1 41 46 47 0=0
Split                    splitncnn_6              1 2 47 48 49
Convolution              conv_18                  1 1 49 50 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_103                 1 1 50 51
Convolution              conv_19                  1 1 51 52 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_104                 1 1 52 53
BinaryOp                 add_4                    2 1 48 53 54 0=0
Split                    splitncnn_7              1 2 54 55 56
Convolution              conv_20                  1 1 56 57 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_105                 1 1 57 58
Convolution              conv_21                  1 1 58 59 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_106                 1 1 59 60
BinaryOp                 add_5                    2 1 55 60 61 0=0
Convolution              conv_22                  1 1 30 62 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_107                 1 1 62 63
Concat                   cat_1                    2 1 61 63 64 0=0
Convolution              conv_23                  1 1 64 65 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_108                 1 1 65 66
Split                    splitncnn_8              1 2 66 67 68
Convolution              conv_24                  1 1 68 69 0=384 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=663552
Swish                    silu_109                 1 1 69 70
Split                    splitncnn_9              1 2 70 71 72
Convolution              conv_25                  1 1 72 73 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_110                 1 1 73 74
Split                    splitncnn_10             1 2 74 75 76
Convolution              conv_26                  1 1 76 77 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_111                 1 1 77 78
Convolution              conv_27                  1 1 78 79 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_112                 1 1 79 80
BinaryOp                 add_6                    2 1 75 80 81 0=0
Split                    splitncnn_11             1 2 81 82 83
Convolution              conv_28                  1 1 83 84 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_113                 1 1 84 85
Convolution              conv_29                  1 1 85 86 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_114                 1 1 86 87
BinaryOp                 add_7                    2 1 82 87 88 0=0
Split                    splitncnn_12             1 2 88 89 90
Convolution              conv_30                  1 1 90 91 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_115                 1 1 91 92
Convolution              conv_31                  1 1 92 93 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_116                 1 1 93 94
BinaryOp                 add_8                    2 1 89 94 95 0=0
Split                    splitncnn_13             1 2 95 96 97
Convolution              conv_32                  1 1 97 98 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_117                 1 1 98 99
Convolution              conv_33                  1 1 99 100 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_118                 1 1 100 101
BinaryOp                 add_9                    2 1 96 101 102 0=0
Split                    splitncnn_14             1 2 102 103 104
Convolution              conv_34                  1 1 104 105 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_119                 1 1 105 106
Convolution              conv_35                  1 1 106 107 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_120                 1 1 107 108
BinaryOp                 add_10                   2 1 103 108 109 0=0
Split                    splitncnn_15             1 2 109 110 111
Convolution              conv_36                  1 1 111 112 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_121                 1 1 112 113
Convolution              conv_37                  1 1 113 114 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_122                 1 1 114 115
BinaryOp                 add_11                   2 1 110 115 116 0=0
Convolution              conv_38                  1 1 71 117 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_123                 1 1 117 118
Concat                   cat_2                    2 1 116 118 119 0=0
Convolution              conv_39                  1 1 119 120 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_124                 1 1 120 121
Split                    splitncnn_16             1 2 121 122 123
Convolution              conv_40                  1 1 123 124 0=768 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=2654208
Swish                    silu_125                 1 1 124 125
Split                    splitncnn_17             1 2 125 126 127
Convolution              conv_41                  1 1 127 128 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912
Swish                    silu_126                 1 1 128 129
Split                    splitncnn_18             1 2 129 130 131
Convolution              conv_42                  1 1 131 132 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_127                 1 1 132 133
Convolution              conv_43                  1 1 133 134 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1327104
Swish                    silu_128                 1 1 134 135
BinaryOp                 add_12                   2 1 130 135 136 0=0
Split                    splitncnn_19             1 2 136 137 138
Convolution              conv_44                  1 1 138 139 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_129                 1 1 139 140
Convolution              conv_45                  1 1 140 141 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1327104
Swish                    silu_130                 1 1 141 142
BinaryOp                 add_13                   2 1 137 142 143 0=0
Convolution              conv_46                  1 1 126 144 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912
Swish                    silu_131                 1 1 144 145
Concat                   cat_3                    2 1 143 145 146 0=0
Convolution              conv_47                  1 1 146 147 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=589824
Swish                    silu_132                 1 1 147 148
Convolution              conv_48                  1 1 148 149 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912
Swish                    silu_133                 1 1 149 150
Split                    splitncnn_20             1 2 150 151 152
Pooling                  maxpool2d_85             1 1 152 153 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_21             1 2 153 154 155
Pooling                  maxpool2d_86             1 1 155 156 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_22             1 2 156 157 158
Pooling                  maxpool2d_87             1 1 158 159 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 151 154 157 159 160 0=0
Convolution              conv_49                  1 1 160 161 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1179648
Swish                    silu_134                 1 1 161 162
Convolution              conv_50                  1 1 162 163 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912
Swish                    silu_135                 1 1 163 164
Split                    splitncnn_23             1 2 164 165 166
Interp                   upsample_167             1 1 166 167 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_5                    2 1 167 122 168 0=0
Split                    splitncnn_24             1 2 168 169 170
Convolution              conv_51                  1 1 170 171 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_136                 1 1 171 172
Convolution              conv_52                  1 1 172 173 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_137                 1 1 173 174
Convolution              conv_53                  1 1 174 175 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_138                 1 1 175 176
Convolution              conv_54                  1 1 176 177 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_139                 1 1 177 178
Convolution              conv_55                  1 1 178 179 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Convolution              conv_56                  1 1 169 180 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_141                 1 1 180 181
Swish                    silu_140                 1 1 179 182
Concat                   cat_6                    2 1 182 181 183 0=0
Convolution              conv_57                  1 1 183 184 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_142                 1 1 184 185
Convolution              conv_58                  1 1 185 186 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_143                 1 1 186 187
Split                    splitncnn_25             1 2 187 188 189
Interp                   upsample_168             1 1 189 190 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_7                    2 1 190 67 191 0=0
Split                    splitncnn_26             1 2 191 192 193
Convolution              conv_59                  1 1 193 194 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_144                 1 1 194 195
Convolution              conv_60                  1 1 195 196 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_145                 1 1 196 197
Convolution              conv_61                  1 1 197 198 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_146                 1 1 198 199
Convolution              conv_62                  1 1 199 200 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_147                 1 1 200 201
Convolution              conv_63                  1 1 201 202 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Convolution              conv_64                  1 1 192 203 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_149                 1 1 203 204
Swish                    silu_148                 1 1 202 205
Concat                   cat_8                    2 1 205 204 206 0=0
Convolution              conv_65                  1 1 206 207 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_150                 1 1 207 208
Split                    splitncnn_27             1 2 208 209 210
Convolution              conv_66                  1 1 210 211 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=331776
Swish                    silu_151                 1 1 211 212
Concat                   cat_9                    2 1 212 188 213 0=0
Split                    splitncnn_28             1 2 213 214 215
Convolution              conv_67                  1 1 215 216 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_152                 1 1 216 217
Convolution              conv_68                  1 1 217 218 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_153                 1 1 218 219
Convolution              conv_69                  1 1 219 220 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Swish                    silu_154                 1 1 220 221
Convolution              conv_70                  1 1 221 222 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_155                 1 1 222 223
Convolution              conv_71                  1 1 223 224 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=331776
Convolution              conv_72                  1 1 214 225 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_157                 1 1 225 226
Swish                    silu_156                 1 1 224 227
Concat                   cat_10                   2 1 227 226 228 0=0
Convolution              conv_73                  1 1 228 229 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_158                 1 1 229 230
Split                    splitncnn_29             1 2 230 231 232
Convolution              conv_74                  1 1 232 233 0=384 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1327104
Swish                    silu_159                 1 1 233 234
Concat                   cat_11                   2 1 234 165 235 0=0
Split                    splitncnn_30             1 2 235 236 237
Convolution              conv_75                  1 1 237 238 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912
Swish                    silu_160                 1 1 238 239
Convolution              conv_76                  1 1 239 240 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_161                 1 1 240 241
Convolution              conv_77                  1 1 241 242 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1327104
Swish                    silu_162                 1 1 242 243
Convolution              conv_78                  1 1 243 244 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=147456
Swish                    silu_163                 1 1 244 245
Convolution              conv_79                  1 1 245 246 0=384 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1327104
Convolution              conv_80                  1 1 236 247 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912
Swish                    silu_165                 1 1 247 248
Swish                    silu_164                 1 1 246 249
Concat                   cat_12                   2 1 249 248 250 0=0
Convolution              conv_81                  1 1 250 251 0=768 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=589824
MemoryData               pnnx_67                  0 1 252 0=2 1=20 11=20 2=3
MemoryData               pnnx_68                  0 1 253 0=2 1=20 11=20 2=3
MemoryData               pnnx_69                  0 1 254 0=2 1=40 11=40 2=3
MemoryData               pnnx_70                  0 1 255 0=2 1=40 11=40 2=3
MemoryData               pnnx_72                  0 1 256 0=2 1=80 11=80 2=3
MemoryData               pnnx_74                  0 1 257 0=2 1=80 11=80 2=3
Convolution              conv_82                  1 1 209 out1 0=255 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=48960
Reshape                  view_172                 1 1 out1 259 0=80 1=80 11=85 2=3
Permute                  permute_178              1 1 259 260 0=3
Sigmoid                  sigmoid_0                1 1 260 261
Slice                    split_0                  1 3 261 262 263 264 -23300=3,2,2,81 1=3
MemoryData               pnnx_fold_715            0 1 265 0=1
Eltwise                  weighted_sum_0           2 1 262 257 266 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 mul_16                   2 1 266 265 267 0=2
BinaryOp                 mul_17                   1 1 263 268 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_18                   1 1 268 269 0=4
BinaryOp                 mul_19                   2 1 269 256 270 0=2
Concat                   cat_13                   3 1 267 270 264 271 0=3
Convolution              conv_83                  1 1 231 out2 0=255 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=97920
Reshape                  view_173                 1 1 out2 273 0=40 1=40 11=85 2=3
Permute                  permute_179              1 1 273 274 0=3
Sigmoid                  sigmoid_1                1 1 274 275
Slice                    split_1                  1 3 275 276 277 278 -23300=3,2,2,81 1=3
MemoryData               pnnx_fold_751            0 1 279 0=1
Eltwise                  weighted_sum_1           2 1 276 255 280 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 mul_22                   2 1 280 279 281 0=2
BinaryOp                 mul_23                   1 1 277 282 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_24                   1 1 282 283 0=4
BinaryOp                 mul_25                   2 1 283 254 284 0=2
Concat                   cat_14                   3 1 281 284 278 285 0=3
Swish                    silu_166                 1 1 251 286
Convolution              conv_84                  1 1 286 out3 0=255 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=195840
Reshape                  view_174                 1 1 out3 288 0=20 1=20 11=85 2=3
Permute                  permute_180              1 1 288 289 0=3
Sigmoid                  sigmoid_2                1 1 289 290
Slice                    split_2                  1 3 290 291 292 293 -23300=3,2,2,81 1=3
MemoryData               pnnx_fold_787            0 1 294 0=1
Eltwise                  weighted_sum_2           2 1 291 253 295 0=1 -23301=2,2.000000e+00,1.000000e+00
BinaryOp                 mul_28                   2 1 295 294 296 0=2
BinaryOp                 mul_29                   1 1 292 297 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_30                   1 1 297 298 0=4
BinaryOp                 mul_31                   2 1 298 252 299 0=2
Concat                   cat_15                   3 1 296 299 293 300 0=3
Reshape                  view_177                 1 1 271 301 0=85 1=19200
Reshape                  view_176                 1 1 285 302 0=85 1=4800
Reshape                  view_175                 1 1 300 303 0=85 1=1200
Concat                   cat_16                   3 1 301 302 303 out0 0=0
